; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v3 ?v11)
             (pred_5 ?v9 ?v8)
             (pred_11 ?v3 ?v8)
             (pred_10 ?v12 ?v3 )
	     (pred_2 ?v3)
             (pred_7 ?v13)
             (pred_6 ?v9)
             (pred_3 ?v8)
             (pred_1 ?v3)
             (pred_4 ?v9)
             (pred_12 ?v3)
             (pred_8 ))



(:action op_2
:parameters (?v6 ?v10 ?v1 ?v4)
:precondition (and (pred_7 ?v6) (pred_7 ?v10) (pred_6 ?v1) (pred_3 ?v4)
          (pred_9 ?v6 ?v10) (pred_5 ?v1 ?v4)
                   (pred_11 ?v10 ?v4) (pred_2 ?v6) 
                   (pred_1 ?v10) (pred_4 ?v1))
:effect (and  (pred_12 ?v10) (not (pred_1 ?v10))))


(:action op_1
:parameters (?v6 ?v5)
:precondition (and (pred_7 ?v6) (pred_7 ?v5)
               (pred_2 ?v6) (pred_9 ?v6 ?v5) (pred_12 ?v5))
:effect (and (pred_2 ?v5) (not (pred_2 ?v6))))

(:action op_3
:parameters (?v6 ?v1)
:precondition (and (pred_7 ?v6) (pred_6 ?v1) 
                  (pred_2 ?v6) (pred_10 ?v1 ?v6) (pred_8 ))
:effect (and (pred_4 ?v1)
   (not (pred_10 ?v1 ?v6)) (not (pred_8 ))))


(:action op_4
:parameters (?v6 ?v2 ?v7)
:precondition (and (pred_7 ?v6) (pred_6 ?v2) (pred_6 ?v7)
                  (pred_2 ?v6) (pred_4 ?v7) (pred_10 ?v2 ?v6))
:effect (and (pred_4 ?v2) (pred_10 ?v7 ?v6)
        (not (pred_4 ?v7)) (not (pred_10 ?v2 ?v6))))

(:action op_5
:parameters (?v6 ?v1)
:precondition (and (pred_7 ?v6) (pred_6 ?v1) 
                  (pred_2 ?v6) (pred_4 ?v1))
:effect (and (pred_8 ) (pred_10 ?v1 ?v6) (not (pred_4 ?v1)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_06 obj_14 obj_18 obj_23 obj_10 obj_16 obj_26 obj_08 obj_07 obj_24 obj_31 obj_12 obj_22 obj_19 obj_15 obj_04 obj_13 obj_02 obj_30 obj_27 obj_09 obj_21 obj_03 obj_05 obj_20
    obj_17 obj_01 obj_32
    obj_29 obj_11 obj_25 obj_28
    )

    (:init
       (pred_8)

       (pred_7 obj_06)
       (pred_7 obj_14)
       (pred_7 obj_18)
       (pred_7 obj_23)
       (pred_7 obj_10)
       (pred_7 obj_16)
       (pred_7 obj_26)
       (pred_7 obj_08)
       (pred_7 obj_07)
       (pred_7 obj_24)
       (pred_7 obj_31)
       (pred_7 obj_12)
       (pred_7 obj_22)
       (pred_7 obj_19)
       (pred_7 obj_15)
       (pred_7 obj_04)
       (pred_7 obj_13)
       (pred_7 obj_02)
       (pred_7 obj_30)
       (pred_7 obj_27)
       (pred_7 obj_09)
       (pred_7 obj_21)
       (pred_7 obj_03)
       (pred_7 obj_05)
       (pred_7 obj_20)
       (pred_3 obj_17)
       (pred_3 obj_01)
       (pred_3 obj_32)
       (pred_6 obj_29)
       (pred_6 obj_11)
       (pred_6 obj_25)
       (pred_6 obj_28)

       (pred_9 obj_06 obj_16)
       (pred_9 obj_06 obj_14)
       (pred_9 obj_14 obj_26)
       (pred_9 obj_14 obj_18)
       (pred_9 obj_14 obj_06)
       (pred_9 obj_18 obj_08)
       (pred_9 obj_18 obj_23)
       (pred_9 obj_18 obj_14)
       (pred_9 obj_23 obj_07)
       (pred_9 obj_23 obj_10)
       (pred_9 obj_23 obj_18)
       (pred_9 obj_10 obj_24)
       (pred_9 obj_10 obj_23)
       (pred_9 obj_16 obj_31)
       (pred_9 obj_16 obj_26)
       (pred_9 obj_16 obj_06)
       (pred_9 obj_26 obj_12)
       (pred_9 obj_26 obj_08)
       (pred_9 obj_26 obj_14)
       (pred_9 obj_26 obj_16)
       (pred_9 obj_08 obj_22)
       (pred_9 obj_08 obj_07)
       (pred_9 obj_08 obj_18)
       (pred_9 obj_08 obj_26)
       (pred_9 obj_07 obj_19)
       (pred_9 obj_07 obj_24)
       (pred_9 obj_07 obj_23)
       (pred_9 obj_07 obj_08)
       (pred_9 obj_24 obj_15)
       (pred_9 obj_24 obj_10)
       (pred_9 obj_24 obj_07)
       (pred_9 obj_31 obj_04)
       (pred_9 obj_31 obj_12)
       (pred_9 obj_31 obj_16)
       (pred_9 obj_12 obj_13)
       (pred_9 obj_12 obj_22)
       (pred_9 obj_12 obj_26)
       (pred_9 obj_12 obj_31)
       (pred_9 obj_22 obj_02)
       (pred_9 obj_22 obj_19)
       (pred_9 obj_22 obj_08)
       (pred_9 obj_22 obj_12)
       (pred_9 obj_19 obj_30)
       (pred_9 obj_19 obj_15)
       (pred_9 obj_19 obj_07)
       (pred_9 obj_19 obj_22)
       (pred_9 obj_15 obj_27)
       (pred_9 obj_15 obj_24)
       (pred_9 obj_15 obj_19)
       (pred_9 obj_04 obj_09)
       (pred_9 obj_04 obj_13)
       (pred_9 obj_04 obj_31)
       (pred_9 obj_13 obj_21)
       (pred_9 obj_13 obj_02)
       (pred_9 obj_13 obj_12)
       (pred_9 obj_13 obj_04)
       (pred_9 obj_02 obj_03)
       (pred_9 obj_02 obj_30)
       (pred_9 obj_02 obj_22)
       (pred_9 obj_02 obj_13)
       (pred_9 obj_30 obj_05)
       (pred_9 obj_30 obj_27)
       (pred_9 obj_30 obj_19)
       (pred_9 obj_30 obj_02)
       (pred_9 obj_27 obj_20)
       (pred_9 obj_27 obj_15)
       (pred_9 obj_27 obj_30)
       (pred_9 obj_09 obj_21)
       (pred_9 obj_09 obj_04)
       (pred_9 obj_21 obj_03)
       (pred_9 obj_21 obj_13)
       (pred_9 obj_21 obj_09)
       (pred_9 obj_03 obj_05)
       (pred_9 obj_03 obj_02)
       (pred_9 obj_03 obj_21)
       (pred_9 obj_05 obj_20)
       (pred_9 obj_05 obj_30)
       (pred_9 obj_05 obj_03)
       (pred_9 obj_20 obj_27)
       (pred_9 obj_20 obj_05)
       (pred_1 obj_24)
       (pred_1 obj_02)
       (pred_1 obj_13)
       (pred_1 obj_03)
       (pred_11  obj_24 obj_17)
       (pred_11  obj_02 obj_01)
       (pred_11  obj_13 obj_32)
       (pred_11  obj_03 obj_32)
       (pred_12 obj_06)
       (pred_12 obj_14)
       (pred_12 obj_18)
       (pred_12 obj_23)
       (pred_12 obj_10)
       (pred_12 obj_16)
       (pred_12 obj_26)
       (pred_12 obj_08)
       (pred_12 obj_07)
       (pred_12 obj_31)
       (pred_12 obj_12)
       (pred_12 obj_22)
       (pred_12 obj_19)
       (pred_12 obj_15)
       (pred_12 obj_04)
       (pred_12 obj_30)
       (pred_12 obj_27)
       (pred_12 obj_09)
       (pred_12 obj_21)
       (pred_12 obj_05)
       (pred_12 obj_20)

       (pred_5  obj_29 obj_17)
       (pred_5  obj_11 obj_01)
       (pred_5  obj_25 obj_32)
       (pred_5  obj_28 obj_32)
       (pred_10 obj_29 obj_08)
       (pred_10 obj_11 obj_04)
       (pred_10 obj_25 obj_05)
       (pred_10 obj_28 obj_06)
       (pred_2 obj_05)
    )

    (:goal (and
       (pred_10 obj_28 obj_12)
    ))
(:constraints
  (always (not (pred_2 obj_26)))
)
)

; plan
1. (op_1 obj_05 obj_30)
   deleted: (pred_2 obj_05)
   added: (pred_2 obj_30)
   goals met: 0 of 1
2. (op_1 obj_30 obj_19)
   deleted: (pred_2 obj_30)
   added: (pred_2 obj_19)
   goals met: 0 of 1
3. (op_1 obj_19 obj_22)
   deleted: (pred_2 obj_19)
   added: (pred_2 obj_22)
   goals met: 0 of 1
4. (op_1 obj_22 obj_12)
   deleted: (pred_2 obj_22)
   added: (pred_2 obj_12)
   goals met: 0 of 1
5. (op_1 obj_12 obj_31)
   deleted: (pred_2 obj_12)
   added: (pred_2 obj_31)
   goals met: 0 of 1
6. (op_1 obj_31 obj_16)
   deleted: (pred_2 obj_31)
   added: (pred_2 obj_16)
   goals met: 0 of 1
7. (op_1 obj_16 obj_06)
   deleted: (pred_2 obj_16)
   added: (pred_2 obj_06)
   goals met: 0 of 1
8. (op_3 obj_06 obj_28)
   deleted: (pred_10 obj_28 obj_06) (pred_8)
   added: (pred_4 obj_28)
   goals met: 0 of 1
9. (op_1 obj_06 obj_16)
   deleted: (pred_2 obj_06)
   added: (pred_2 obj_16)
   goals met: 0 of 1
10. (op_1 obj_16 obj_31)
   deleted: (pred_2 obj_16)
   added: (pred_2 obj_31)
   goals met: 0 of 1
11. (op_1 obj_31 obj_12)
   deleted: (pred_2 obj_31)
   added: (pred_2 obj_12)
   goals met: 0 of 1
12. (op_5 obj_12 obj_28)
   deleted: (pred_4 obj_28)
   added: (pred_8) (pred_10 obj_28 obj_12)
   goals met: 1 of 1
